Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Now that you have the permissions sorted out, you need to determine what paths the commits being pushed have modified, so you can make sure the user who’s pushing has access to all of them.
cs: Nyní, když jste uspořádali příslušná oprávnění, zbývá zjistit, která umístění odesílané revize změnily, abyste měli jistotu, že k nim ke všem má odesílající uživatel přístup.

source: Now that your filter is ready, you can test it by setting up a file with your `$Date$` keyword and then setting up a Git attribute for that file that engages the new filter:
cs: Nyní, když máte filtr hotový, můžete ho otestovat vytvořením souboru s klíčovým slovem `$Date$` a nastavením atributu Git pro tento soubor, jímž nový filtr aktivujete:

source: Now that your identity is set up, you can configure the default text editor that will be used when Git needs you to type in a message.
cs: Nyní, když jste zadali své osobní údaje, můžete nastavit výchozí textový editor, který se použije, když po vás Git bude chtít napsat nějakou zprávu.

source: Now that your staging area is set up the way you want it, you can commit your changes.
cs: Nyní, když jste seznam připravených změn nastavili podle svých představ, můžete začít zapisovat změny.

source: Now that your work is merged in, you have no further need for the `iss53` branch.
cs: Nyní, když jste svou práci sloučili, větev `iss53` už nebudete potřebovat.

source: Now that you’re here, let’s get started.
cs: Nyní se však už pusťme do práce.

source: Now that you’ve created, merged, and deleted some branches, let’s look at some branch-management tools that will come in handy when you begin using branches all the time.
cs: Nyní, když jste vytvořili, sloučili a odstranili své první větve, můžeme se podívat na pár nástrojů ke správě větví, které se vám budou hodit, až začnete s větvemi pracovat pravidelně.

source: Now that you’ve seen the difficulties of the submodule system, let’s look at an alternate way to solve the same problem.
cs: Nyní, když jsme poznali obtíže spojené se systémem submodulů, podívejme se na jedno alternativní řešení tohoto problému.

source: Now the first two commits aren’t reachable by anything:
cs: První dvě revize tak nejsou odnikud dostupné:

source: Now you can add them all to your 'mobile' team so they have read and write access to `iphone_project`:
cs: Nyní je můžete všechny přidat do týmu 'mobile', čímž získají oprávnění pro čtení i pro zápis k `iphone_project`:

source: Now you can fast-forward your master branch (see Figure 3-33):
cs: Nyní můžete posunout hlavní větev „rychle vpřed“ (viz obrázek 3-33):

source: Now you can look at your new commit object with `cat-file`:
cs: Nyní se můžete podívat na nově vytvořený objekt revize. Použijte příkaz `cat-file`:

source: Now you can remove your topic branch and drop the commits you didn’t want to pull in.
cs: Nyní můžete tematickou větev odstranit a zahodit revize, které nehodláte natáhnout do jiné větve.

source: Now you can revert the file back to the first version
cs: Soubor nyní můžete vrátit do první verze:

source: Now you can see how Git has stored your data:
cs: Nyní se můžete podívat, jak Git vaše data uložil:

source: Now you can see that the TODO and index.html files are staged and the simplegit.rb file is still unstaged.
cs: Jak vidíte, soubory TODO a index.html jsou připraveny k zapsání, soubor simplegit.rb nikoli.

source: Now you can send the maintainer a message that you’ve made the requested changes and they can find those changes in your `featureBv2` branch (see Figure 5-18).
cs: Nyní můžete správci oznámit, že jste provedli požadované změny a že je najde ve vaší větvi `featureBv2` (viz obrázek 5-18).

source: Now you can set up your config file to use your custom merge resolution and diff tools.
cs: Nyní můžete nastavit konfigurační soubor k používání vlastních nástrojů diff a nástrojů k řešení slučování.

source: Now you can switch back to your work-in-progress branch on issue #53 and continue working on it (see Figure 3-15):
cs: Nyní můžete přepnout zpět na větev s rozdělanou prací a pokračovat na chybě č. 53 (viz obrázek 3-15):

source: Now you can take the changes that have been reset, and create multiple commits out of them.
cs: Teď můžete vzít změny, které jste resetovali, a vytvořit z nich několik dílčích revizí.

source: Now you can use `git diff` to see what is still unstaged
cs: Příkaz `git diff` nyní můžete použít k zobrazení změn, které dosud nejsou připraveny:

source: Now you can use the string `pb` on the command line in lieu of the whole URL.
cs: Řetězec `pb` nyní můžete používat na příkazovém řádku místo kompletní adresy URL.

source: Now you get the call that there is an issue with the web site, and you need to fix it immediately.
cs: V tomto okamžiku vám zavolají, že se na webových stránkách vyskytl problém, který musíte okamžitě vyřešit.

source: Now you have a directory named `gitosis-admin`, which has two major parts:
cs: Nyní máte adresář s názvem `gitosis-admin`, sestávající ze dvou hlavních částí:

source: Now you have a list of the remote references and SHAs.
cs: Nyní máte k dispozici seznam SHA a referencí na vzdálené repozitáře.

source: Now you have a new repository on GitHub (see Figure 4-6).
cs: Nyní máte na serveru GitHub vytvořen nový repozitář (viz obrázek 4-6).

source: Now you have a topic branch that contains contributed work.
cs: Nyní máte tematickou větev s prací, kterou jste obdrželi od jiného vývojáře.

source: Now you have the Rack project under a subdirectory named `rack` within your project.
cs: Nyní máte projekt Rack uložen ve svém projektu v podadresáři `rack`.

source: Now you have the root of the Rack project in your `rack_branch` branch and your own project in the `master` branch.
cs: Nyní máte kořenový adresář s projektem Rack ve větvi `rack_branch` a vlastní projekt ve větvi `master`.

source: Now you have two commits that you want to send to the mailing list.
cs: Nyní máte dvě revize, které chcete odeslat do poštovní konference.

source: Now you should have a nicer Subversion import in your `my_project` directory.
cs: Import ze systému Subversion v adresáři `my_project` by měl nyní vypadat o něco lépe.

source: Now you want to release a build.
cs: Nyní budete chtít sestavení vydat.

source: Now you want to switch branches, but you don’t want to commit what you’ve been working on yet; so you’ll stash the changes.
cs: Nyní chcete přepnout na jinou větev, ale nechcete zapsat změny, na nichž jste dosud pracovali – proto změny odložíte.

source: Now your `rack` subdirectory is at the exact state it was in when you committed earlier.
cs: Váš podadresář `rack` je nyní přesně ve stejném stavu, jako když jste předtím zapisovali revizi.

source: Now your history looks like Figure 5-27.
cs: Vaše historie revizí bude nyní vypadat jako na obrázku 5-27.

source: Now your new project root is what was in the `trunk` subdirectory each time.
cs: Vaším nový kořenovým adresářem je nyní obsah podadresáře `trunk`.

source: Now your project history has diverged (see Figure 3-9).
cs: Nyní se historie vašeho projektu rozdělila (viz obrázek 3-9).

source: Now your project is hosted on GitHub, and you can give the URL to anyone you want to share your project with.
cs: Nyní je váš projekt hostován na serveru GitHub a vy můžete dát adresu URL komukoli, s kým chcete svůj projekt sdílet.

source: Now your users can’t push any commits with badly formed messages or with modified files outside of their designated paths.
cs: Vaši uživatelé tak už teď nebudou moci odesílat revize se zprávami v nepatřičném tvaru nebo se soubory změněnými mimo umístění jim vyhrazená.

source: Now you’ll explore a number of very powerful things that Git can do that you may not necessarily use on a day-to-day basis but that you may need at some point.
cs: Nyní poznáte několik velmi účinných nástrojů, které vám Git nabízí. Pravděpodobně je nebudete používat každý den, ale přesto se vám mohou čas od času hodit.

source: Now you’ll learn a few of the more interesting options that you can set in this manner to customize your Git usage.
cs: Nyní se podíváme na pár dalších zajímavých možností, jež můžete tímto způsobem nastavit, a přizpůsobit tak systém Git svým individuálním potřebám.

source: Now you’re on another commit, halfway between the one you just tested and your bad commit.
cs: Nyní jste na jiné revizi, na půl cesty mezi revizí, kterou jste právě otestovali, a problémovou revizí.

source: Now you’re ready to add your contributed work into this topic branch and determine if you want to merge it into your longer-term branches.
cs: Nyní tedy můžete vložit svůj příspěvek do této tematické větve a rozhodnout se, zda ho chcete začlenit do svých trvalejších větví.

source: Now you’re ready to begin printing out the commit data for your importer.
cs: Nyní je už vše připraveno k vygenerování dat revizí pro váš importér.

source: Now you’re ready to collaborate on the same project.
cs: Nic vám teď nebrání začít spolupracovat na projektu.

source: Now you’ve created your first commit!
cs: Nyní jste vytvořili svou první revizi!

source: Now, Git will check the integrity of your repository before each push is accepted to make sure faulty clients aren’t introducing corrupt data.
cs: Git nyní bude kontrolovat integritu vašeho repozitáře před přijetím odeslaných souborů, aby zajistil, že defektní klienti nedodávají data s chybami.

source: Now, Git will use the KDiff3 tool for diff viewing and merge conflict resolution.
cs: Git bude nyní k zobrazení výstupů nástoje diff a k řešení konfliktů při slučování používat nástroj KDiff3.

source: Now, Git won’t try to convert or fix CRLF issues; nor will it try to compute or print a diff for changes in this file when you run `git show` or `git diff` on your project.
cs: Až v projektu spustíte příkaz `git show` nebo `git diff`, Git se nebude pokoušet konvertovat nebo opravovat chyby CRLF ani vypočítat ani zobrazit rozdíly v tomto souboru pomocí nástroje diff.

source: Now, Jessica can merge her topic work into her `master` branch, merge John’s work (`origin/master`) into her `master` branch, and then push back to the server again.
cs: Jessica nyní může začlenit tematickou větev do své větve `master`, začlenit (merge) i Johnovu práci (`origin/master`) do své větve `master` a vše odeslat zpět na server.

source: Now, Jessica makes a couple of commits on the `featureB` branch:
cs: Jessica nyní vytvoří několik revizí ve větvi `featureB`:

source: Now, Jessica pushes her work up to the server:
cs: Jessica nyní odešle svou práci na server:

source: Now, John can test his code to make sure it still works properly, and then he can push his new merged work up to the server:
cs: John nyní může otestovat svůj kód, aby se ujistil, že stále pracuje správně, a pak může odeslat svou novou sloučenou práci na server:

source: Now, `gc` your database and see how much space you’re using:
cs: Teď provedete `gc` své databáze, protože chcete zjistit, kolik místa je obsazeno:

source: Now, all your work is on top of what is on the Subversion server, so you can successfully `dcommit`:
cs: Nyní je všechna vaše práce na vrcholu revizí, které jsou na serveru Subversion. Příkaz `dcommit` bude nyní úspěšně proveden:

source: Now, each of your topics is contained within a silo — similar to a patch queue — that you can rewrite, rebase, and modify without the topics interfering or interdepending on each other as in Figure 5-16.
cs: Nyní mají obě vaše témata samostatný zásobník – podobně jako řada záplat – které můžete přepsat, přeskládat a upravit, aniž by se tím obě témata navzájem ovlivňovala nebo omezovala (viz obrázek 5-16).

source: Now, each user that does this has to send their public key to you or whoever is administrating the Git server (assuming you’re using an SSH server setup that requires public keys).
cs: Každý uživatel, který si tímto způsobem nechá vygenerovat veřejný klíč, ho nyní pošle vám nebo jinému správci serveru Git (za předpokladu, že používáte nastavení SSH serveru vyžadující veřejné klíče).

source: Now, if you commit and push the project, GitWeb will automatically start showing the `iphone_project`.
cs: Pokud teď zapíšete a odešlete projekt, GitWeb začne automaticky zobrazovat `iphone_project`.

source: Now, if you want to merge your `opera` branch into `trunk` (your `master` branch), you can do so with a normal `git merge`.
cs: Budete-li nyní chtít začlenit větev `opera` do větve `trunk` (vaše větev `master`), můžete tak učinit běžným příkazem `git merge`.

source: Now, let’s add a new project for you.
cs: Nyní přidáme nový projekt.

source: Now, let’s say you decide you like the second solution to your issue best (`iss91v2`); and you showed the `dumbidea` branch to your coworkers, and it turns out to be genius.
cs: Řekněme, že se nyní rozhodnete, že druhé řešení vašeho problému bude vhodnější (`iss91v2`). Dále jste také ukázali svůj nápad ve větvi `dumbidea` kolegům a ti ho považují za geniální.

source: Now, modify that file a little, and see what happens:
cs: Nyní soubor trochu upravíme a uvidíme, co se stane:

source: Now, move the `master` branch back to the middle commit:
cs: Nyní vrátíme větev `master` zpět na prostřední revizi:

source: Now, no matter what is set as your default shell editor variable, Git will fire up Emacs to edit messages.
cs: Nyní už nezáleží na tom, jaký editor máte v shellu nastaven jako výchozí, Git bude k editaci zpráv spouštět Emacs.

source: Now, pay attention.
cs: A nyní pozor.

source: Now, run the `cat-file` command on that SHA-1 value:
cs: Nyní pro tuto hodnotu SHA-1 spusťte příkaz `cat-file`:

source: Now, someone else does more work that includes a merge, and pushes that work to the central server.
cs: Někdo jiný teď provede jiné úpravy, jejichž součástí bude i začlenění, a odešle svou práci na centrální server.

source: Now, store some text in your Git database:
cs: Nyní můžete uložit kousek textu do databáze Git:

source: Now, suppose you forgot to tag the project at `v1.2`, which was at the "updated rakefile" commit.
cs: Nyní předpokládejme, že jste projektu zapomněli přidělit značku `v1.2`, která byla obsažena v revizi označené jako „updated rakefile“.

source: Now, the 'git' user can only use the SSH connection to push and pull Git repositories and can’t shell onto the machine.
cs: Uživatel 'git' nyní může používat SSH připojení k odesílání a stahování repozitářů Git, ale nemůže se přihlásit k počítači.

source: Now, the snapshot pointed to by C3' is exactly the same as the one that was pointed to by C5 in the merge example.
cs: Snímek, na který nyní ukazuje revize C3', je zcela totožný se snímkem, na který v příkladu v části o slučování ukazovala C5.

source: Now, when someone else clones or pulls from your repository, they will get all your tags as well.
cs: Pokud nyní někdo bude klonovat nebo stahovat z vašeho repozitáře, stáhne rovněž všechny vaše značky.

source: Now, when you run `git archive` to create a tarball of your project, that directory won’t be included in the archive.
cs: Až nyní spustíte příkaz `git archive` k vytvoření tarballu projektu, nebude tento adresář součástí archivu.

source: Now, you can add content to Git and pull it back out again.
cs: Nyní tedy umíte vložit do systému Git určitý obsah a ten poté zase vytáhnout.

source: Now, you can run `git fetch teamone` to fetch everything the remote `teamone` server has that you don’t have yet.
cs: Nyní můžete spustit příkaz `git fetch teamone`, který ze vzdáleného serveru `teamone` vyzvedne vše, co ještě nemáte.

source: Now, you can run `git log` to see your new history:
cs: Nyní si můžete nechat příkazem `git log` zobrazit svoji novou historii:

source: Now, you can set up an empty repository for your users by running `git init` with the `--bare` option, which initializes the repository without a working directory:
cs: Nyní pro ně můžete nastavit prázdný repozitář. Spusťte příkaz `git init` s parametrem `--bare`, který inicializuje repozitář bez pracovního adresáře:

source: Now, you can sign tags without having to specify your key every time with the `git tag` command:
cs: Nyní můžete podepisovat značky, aniž byste museli pokaždé znovu zadávat svůj klíč příkazem `git tag`:

source: Now, you can use the `write-tree` command to write the staging area out to a tree object.
cs: Nyní můžete použít příkaz `write-tree`, jímž zapíšete stav oblasti připravovaných změn neboli indexu do objektu stromu.

source: Now, you can use the head reference you just created instead of the SHA-1 value in your Git commands:
cs: Nyní můžete v příkazech Git používat „head“ referenci, kterou jste právě vytvořili, místo hodnoty SHA-1:

source: Now, you need to make Apache use CGI for that script, for which you can add a VirtualHost:
cs: Nyní musíte zajistit, aby server Apache používal CGI pro skript, pro který můžete přidat VirtualHost:

source: Now, you need to remove this file from all trees in your past.
cs: Nyní potřebujete odstranit tento soubor ze všech minulých stromů.

source: Now, you need to set up a filter in Git (call it `dater`) and tell it to use your `expand_date` filter to smudge the files on checkout.
cs: Nyní budete muset nastavit filtr v systému Git (pojmenujte ho `dater`) a určit, aby k operaci smudge při checkoutu souborů používal filtr `expand_date`.

source: Now, your Git database conceptually looks something like Figure 9-4.
cs: Vaše databáze Git bude nyní v principu vypadat tak, jak je znázorněno na obrázku 9-4.

source: Now, your local branch `sf` will automatically push to and pull from `origin/serverfix`.
cs: Vaše lokální větev `sf` bude nyní automaticky stahovat data ze vzdálené větve `origin/serverfix` a bude do ní i odesílat.

source: Occasionally, Git automatically runs a command called "auto gc".
cs: Git čas od času automaticky spustí příkaz „auto gc“.

source: Occasionally, this process doesn’t go smoothly.
cs: Může se stát, že sloučení neproběhne bez problémů.

source: Occasionally, you may have to do some cleanup — make a repository more compact, clean up an imported repository, or recover lost work.
cs: Občas budete patrně nuceni přistoupit k menšímu úklidu – uvést repozitář do kompaktnější podoby, vyčistit importovaný repozitář nebo obnovit ztracenou práci.

source: Oddly enough, you have a real Git history now that you can view with the `git log` command, if you run it on the last commit SHA-1:
cs: Může se to zdát zvláštní, ale nyní máte vytvořenu skutečnou historii revizí Git, kterou lze zobrazit příkazem `git log` spuštěným pro hodnotu SHA-1 poslední revize:

source: Of course, a refex can be far more powerful than shown here, so don’t overdo it if you’re not comfortable with Perl regexes.
cs: Refex může mít samozřejmě mnohem více použití než je tady ukázáno, takže si dejte pozor ať to nepřeženete, zvláště pokud nejste kovaní v perlovských regulárních výrazech.

source: Of the more than 36,000 commits in the Git source code history, this command shows the 6 that match those criteria.
cs: Z více než 36 tisíc revizí v historii zdrojového kódu Git zobrazí tento příkaz 6 záznamů, které odpovídají zadaným kritériím.

source: Often, the quickest way is to use a tool called `git reflog`.
cs: Nejrychlejší cestou často bývá použít nástroj `git reflog`.

source: Often, when you’ve been working on part of your project, things are in a messy state and you want to switch branches for a bit to work on something else.
cs: Až budete pracovat na některé části svého projektu, často vám může připadat, že je vaše práce poněkud neuspořádaná a vy budete třeba chtít přepnout větve a pracovat na chvíli na něčem jiném.

source: Often, you’ll do this to make sure your commits apply cleanly on a remote branch — perhaps in a project to which you’re trying to contribute but that you don’t maintain.
cs: Tuto metodu budete často používat v situaci, kdy chcete mít jistotu, že byly vaše revize čistě aplikovány na vzdálenou větev – např. v projektu, do nějž chcete přidat příspěvek, který ale nespravujete.

source: Often, you’ll have a class of files that you don’t want Git to automatically add or even show you as being untracked.
cs: Ve vašem adresáři se často vyskytne skupina souborů, u nichž nebudete chtít, aby je Git automaticky přidával nebo aby je vůbec uváděl jako nesledované.

source: On Linux machines, `lighttpd` is often installed, so you may be able to get it to run by typing `git instaweb` in your project directory.
cs: V počítačích se systémem Linux je často nainstalován `lighttpd`. Spustit ho lze zadáním příkazu `git instaweb` v adresáři vašeho projektu.

source: On Windows systems, Git looks for the `.gitconfig` file in the `$HOME` directory (`%USERPROFILE%` in Windows’ environment), which is `C:\Documents and Settings\$USER` or `C:\Users\$USER` for most people, depending on version (`$USER` is `%USERNAME%` in Windows’ environment).
cs: Ve Windows Git hledá soubor `.gitconfig` v adresáři `$HOME` (v proměnných prostředí Windows je to `%USERPROFILE%`), což je u většiny uživatelů `C:\Documents and Settings\$USER` nebo `C:\Users\$USER` (`$USER` se ve Windows zapisuje odkazem na proměnnou prostředí `%USERNAME%`).

source: On Windows with the system console, the backslash must be omitted.
cs: V konzolovém okně systému Windows musíte zpětné lomítko vynechat.

source: On a project for which you’re not the maintainer, it’s generally easier to have a branch like `master` always track `origin/master` and to do your work in topic branches that you can easily discard if they’re rejected.
cs: U projektů, u nichž nejste v roli správce, je většinou jednodušší, aby vaše větev `master` stále sledovala větev `origin/master` a abyste práci prováděli v tematických větvích, jichž se můžete beze všeho vzdát v případě, že budou odmítnuty.

source: On an Ubuntu machine, you use an Upstart script.
cs: U počítačů s Ubuntu můžete použít skript Upstart.

source: On other systems, you may want to use `xinetd`, a script in your `sysvinit` system, or something else — as long as you get that command daemonized and watched somehow.
cs: V jiných systémech možná budete chtít použít `xinetd`, skript systému `sysvinit`, nebo podobný skript – můžete-li spouštět příkaz démonizovaný a sledovaný.

source: On the ACL file you looked at earlier, this `get_acl_access_data` method returns a data structure that looks like this:
cs: V kombinaci se souborem ACL, který jsme si ukázali před chvílí, poskytne tato metoda `get_acl_access_data` datovou strukturu v této podobě:

source: On the command line, you can pull down several branches like so:
cs: Několik větví můžete přímo z příkazového řádku stáhnout například takto:

source: Once again, this changes the SHAs of all the commits in your list, so make sure no commit shows up in that list that you’ve already pushed to a shared repository.
cs: Také v tomto případě se změní hodnoty SHA všech revizí v seznamu, a proto se nejprve ujistěte, že seznam neobsahuje žádné revize, které jste už odeslali do sdíleného repozitáře.

source: Once the install is done, you switch to the `gitolite-admin` clone you just made on your workstation, and poke around to see what you got:
cs: Jakmile je instalace dokončena, přepněte se do repozitáře `gitolite-admin`, který jste naklonovali na váš počítač, a podívejte se co tam je:

source: Once you’re satisfied with your changes, run
cs: Jakmile jste s vašimi změnami spokojeni, spusťte
